# StairsTotalNumberOfTreads Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsTotalNumberOfTreads Property
ParameterTypeId Class See Also
---
"Total Number of Treads": Total number of treads
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsTotalNumberOfTreads { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsTotalNumberOfTreads As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsTotalNumberOfTreads {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace